{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "resources": [
    {
      "type": "Microsoft.Portal/dashboards",
      "apiVersion": "2020-09-01-preview",
      "name": "CyberKillChainDashboard",
      "location": "[resourceGroup().location]",
      "properties": {
        "lenses": {
          "0": {
            "order": 0,
            "parts": {
              "0": {
                "position": {
                  "x": 0,
                  "y": 0,
                  "colSpan": 3,
                  "rowSpan": 3
                },
                "metadata": {
                  "inputs": [
                    {
                      "name": "ComponentId",
                      "value": "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspaceName'))]"
                    },
                    {
                      "name": "Query",
                      "value": "AzureActivity | where OperationNameValue == 'ListKeys' or OperationNameValue == 'ListSecrets' | summarize Count = count() by Caller, OperationNameValue, ResourceGroup, ResourceName, _ResourceId"
                    }
                  ],
                  "type": "Microsoft.AzureMonitor.LogAnalytics"
                }
              },
              "1": {
                "position": {
                  "x": 3,
                  "y": 0,
                  "colSpan": 3,
                  "rowSpan": 3
                },
                "metadata": {
                  "inputs": [
                    {
                      "name": "ComponentId",
                      "value": "[resourceId('Microsoft.OperationalInsights/workspaces', parameters('workspaceName'))]"
                    },
                    {
                      "name": "Query",
                      "value": "SecurityAlert | where AlertName == 'Suspicious Activity' | summarize Count = count() by AlertName, Description, Severity, StartTimeUtc"
                    }
                  ],
                  "type": "Microsoft.AzureMonitor.LogAnalytics"
                }
              }
            }
          }
        },
        "metadata": {
          "model": {
            "timeRange": {
              "value": {
                "relative": "24h"
              }
            }
          }
        }
      }
    }
  ]
}