{
  "definition": {
    "$schema": "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#",
    "actions": {
      "Run_query_and_list_results": {
        "inputs": {
          "host": {
            "api": {
              "runtimeUrl": "https://logic-apis-westeurope.azure-apim.net/apim/loganalytics"
            },
            "connection": {
              "name": "@parameters('$connections')['azureloganalytics']['connectionId']"
            }
          },
          "method": "get",
          "path": "/query",
          "queries": {
            "workspaceId": "<YourWorkspaceId>",
            "query": "AzureActivity | where OperationNameValue == 'ListKeys' or OperationNameValue == 'ListSecrets' | summarize Count = count() by Caller, OperationNameValue, ResourceGroup, ResourceName, _ResourceId"
          }
        },
        "runAfter": {},
        "type": "ApiConnection"
      }
    },
    "triggers": {
      "Recurrence": {
        "recurrence": {
          "frequency": "Day",
          "interval": 1
        },
        "type": "Recurrence"
      }
    }
  },
  "parameters": {
    "$connections": {
      "defaultValue": {},
      "type": "Object"
    }
  }
}